import React from "react";
import Post from "./Post";

function Posts() {
  const ANAKIN_IMAGE =
    "https://upload.wikimedia.org/wikipedia/en/thumb/7/74/Anakin-Jedi.jpg/220px-Anakin-Jedi.jpg";
  const RAY_IMAGE =
    "https://specials-images.forbesimg.com/imageserve/5e63b3c8e1e617000759130e/960x0.jpg?fit=scale";
  const CURSOR_IMAGE =
    "https://scontent.fiev9-1.fna.fbcdn.net/v/t31.0-8/16904750_756642974491853_2215548150510320190_o.png?_nc_cat=100&ccb=2&_nc_sid=09cbfe&_nc_ohc=WaZ0IPoLNB8AX9Y4Edo&_nc_ht=scontent.fiev9-1.fna&oh=298f227269c62c6260c3dfbc3c4925d7&oe=600F80B1";
  const THEME_IMAGE =
    "https://scontent.fiev9-1.fna.fbcdn.net/v/t1.0-9/133385634_1749165745239566_775216031730857205_o.png?_nc_cat=107&ccb=2&_nc_sid=730e14&_nc_ohc=OaNiaoS7di0AX-paqCa&_nc_ht=scontent.fiev9-1.fna&oh=19e617ca37a2db3a0154f513bd71c143&oe=60113CB5";

  return (
    <div className="posts">
      <Post
        author={{
          photo: ANAKIN_IMAGE,
          name: "Anakin Skywalker",
          nickname: "@dart_vader",
        }}
        content="WTF? Who is Ray? Why she is Skywalker? Luke...?"
        image={RAY_IMAGE}
        date={"26 февр."}
      />
      <Post
        author={{
          photo: CURSOR_IMAGE,
          name: "CURSOR Education",
          nickname: "@education.cursor",
        }}
        content={`5 правил "за" і "проти" поведінки на співбесіді!
      ⏰5 хв
      Про поведінку та підготовку до співбесід вже існує безліч матеріалів. Ви можете отримати поради і технічні, і по софт скілах. Складається враження, що співбесіда — це вже якась урочиста процесія, до якої треба складати цілий план. Ми підкажемо Вам у цій статті, до чого готуватися варто, а чого краще просто уникнути в процесі працевлаштування. 
      🔴 Ми проти того, щоб Ви:
      🔻 Старалися показати себе в ідеальному світлі
      Немає нічого гіршого, ніж кандидат, який намагається "прикрасити" свої погані звички або ще краще — подати їх в позитивному ключі. Це як, наприклад, людина, яка постійно спізнюється і просипає, розповідає на співбесіді, що ця робота так їй подобається, що вона буде вставати ще за досвіта.
      Або ось це прохання озвучити слабкі і сильні сторони кандидата. Про сильні — він менше соромиться поспівати собі дифірамби, а от про слабкі озвучити не спішить. Майте на увазі, що сильною стороною, яка викликає повагу, є вміння визнати та озвучити свої недоліки. Саме це оцінить грамотний роботодавець, який до речі також заслуговує почути правду про людину, з якою хоче будувати власний бізнес. 
      🔻 Не шукайте в компанію підводних течій
      Буває таке, що кандидат ще себе шукає. Всі ми люди й не кожному вдається ще в школі визначитись для чого хоче присвятити своє свідоме життя. Тож, якщо Ви на разі спробували декілька позицій, але відчуваєте, що шукаєте себе далі, то краще зупиніться на хвильку і замисліться що можете запропонувати працедавцю і яку вакансію шукаєте. Щоб не було такого, що Ви приходите на співбесіду і починається: "знаєте, я пишу статті, а ще можу вести проєкти, ну а ще тестуванням можу зайнятись". А в результаті виявляється, що в жодній посаді кандидат не є повністю компетентним і він просто шукав шляхів, аби потрапити в компанію. Виникає питання "а навіщо?". Тож не розсилайте резюме без конкретної мети, орієнтуйтесь на якусь одну вакансію.
      🔻 Не розказуйте казки
      Буває, що кандидат не зовсім готовий до позиції, вона передбачає складніші завдання, в яких він ще не мав досвід. В такий момент краще перед самим собою визнати неготовність, ніж починати розповідати казки про талант, вивчення матеріалу за тиждень і тд. Так, є речі, які можна довчити швиденько, але 2 роки досвіду довчити за цей час неможливо. 
      🔻 Забудьте погані слова про попереднього роботодавця
      У Вас досі кипить і відчуваєте, що нічого хорошого сказати не вийде? Промовчіть, повідомте, що не хочете коментувати, або не маєте бажання вникати в подробиці. Тільки не починайте співати пісню "а мій працедавець такий-сякий"!
      🔻 Повірте, краще без сюрпризів
      Покажіть що Ви вмієте відносно потреб працедавця й технічного завдання, не потрібно витворяти "невідомо що". Це може налякати або принести багато технічних незручностей.
      🔴 А ось список за що ми "за":
      🔻 Немає нічого поганого в тому, щоб показати як Ви сходите з розуму
      Звичайно, що це ми маємо на увазі позитивну сторону цієї риси. Покажіть Вашу справжню сторону, не бійтеся жартувати, не бійтесь розповідати про божевільні ідеї, про новаторські думки і загалом пропонувати щось свіже, нехай навіть, якщо воно чимось дивакувате. 
      🔻 Не соромтесь демонструвати інтерес
      Ми досі живемо в злегка закомплексованому суспільстві, де місцями вважається, що прояв інтересу — це показ слабкості.
      Ви не мусите співати ті ж дифірамби про любов до компанії, але було б добре, якби Ви розібралися яка позиція компанії на ринку, її політика, конкуренти, цінності, ще до співбесіди. Поцікавтесь планами компанії і заради того, щоб розуміти чи Вам вона підходить, і, щоб проявити інтерес до неї. Такі питання подобаються рекрутерам. 
      🔻 Не знаєте відповіді — не силуйте себе
      Іноді на якісь питання дуже важко відповісти. Виникають затяжні паузи, незручності і паніка кандидата. Не вигадуйте на ходу якісь відповіді. Ви будете відчувати себе значно впевненіше, якщо позбудетесь страху зізнатися в тому, що можете чогось не знати. Просто озвучте, що не маєте відповіді. 
      🔻 Говоріть про свої заслуги
      Чому ж Ви соромитесь говорити про власні досягнення. Все ж таки — це було зроблено Вашими зусиллями. Можливо, Ви боїтесь здатися зазнайкою, але об'єктивні переваги Вас таким не продемонструють. Якщо Ви були одним з передових спеціалістів на попередньому місці роботи — розкажіть про це та підтвердіть фактами.
      🔻 Готуйте опис
      Не сумнівайтесь, що Вас попросять коротко розповісти про себе. Тож підготуйте розповідь! Зробіть цікавою та інтерактивною. Уявіть, що Ви — це стартап, що просить про інвестиції. 
      Розкажіть про Ваш досвід роботи, навчання, продовжіть про актуальні вміння та переваги, далі розкажіть як хочете це все застосовувати на практиці і завершіть тим, які маєте плани. 
      Ви є головний герой цієї процесії і тільки Вам вирішувати як розгорнеться сюжет. Більше про працевлаштування можна дізнатися у програмі JobSupport від CURSOR.EDUCATION.`}
        image={THEME_IMAGE}
        date={"25 декаб."}
      />
    </div>
  );
}

export default Posts;
